// Задача 1. Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

/*
Console.Write("Введите Первое число!: ");
int num1 = Convert.ToInt32(Console.ReadLine());
Console.Write("Ведите Второе число!: ");
int num2 = Convert.ToInt32(Console.ReadLine());

if(num1 >= num2)
{
    Console.WriteLine($"Больше число: " + num1);
}
else
{
    Console.WriteLine($"Больше число: " + num2);
}
/*

// Задача 2. Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.